[
  {
    "title": "Malaibar Foundation signs MoU with Tabah Foundation, Egypt ",
    "desc": "Cairo: Malaibar Foundation for Research and Development based at Markaz Knowledge City signs an MoU with Tabah Foundation based at Egypt. Dr. Abdul Hakkim Azhari, Managing Director, Markaz Knowledge City and Chairman, Malaibar Foundation and Muhammed Shadid, Chief, Tabah Foundation signed the MoU at Tabah Foundation’s headquarters at Cairo, Egypt. It was also mutually agreed to conduct research and publication projects, seminars and workshops on various contemporary and traditional issues.  Abdul Hakkim Azhari said that the MoU with the Tabah Foundation, which implements various projects in various social, humanitarian and scientific fields such as world peace, Sufism, and prophetic history, will be instrumental in new contributions in these fields of study.  The event was attended by Jalal Nurani and Yaseen Azhari."
  },
  {
    "title": "Markaz Knowledge City welcomes its first residents.",
    "desc": "Markaz Knowledge city has unfolded a new chapter of achievement in its success saga as it witnessed the grand Key handing ceremony (Phase 01) of tower 2 of Landmark apartments. Keys of 5 apartments at Landmark village were handed over as a token of gratitude to Haji Abdurahman Kuttoor, MD, Baniyas Spike Group of Companies who was one of the chief patrons of Markaz Knowledge City during its primary days.The programme was presided by Arun Kumar (MD, Landmark Builders and Anwar Sadath (Director, Landmark Builders) introduced the session.The keys were handed over by Sheikh Abubakr Ahmad (Grand Mufti of India). Sayyid Ali Bafaqy Thangal (President,Jamia Markaz), Sayyed Zainul Abideeen Bafaqy (Vice preside…"
  },
  {
    "title": "Dr. Muhammad Abdul Hakkim Azhari, Managing Director ,Markaz Knowledge city inaugurated the function .",
    "desc": "Kozhikode: An international seminar on 'Brain studies; advancements and prospects' was organized at Markaz Knowledge City in Kozhikode on Sunday. The seminar was organized jointly by Jamia Markaz and Uskudar University, Turkey.Dr Nevzat Tarhan, a leading neuroscientist and founder of Uskudar University, delivered the keynote address.He said that Uskudar University will cooperate with Jamia Markaz and its sciencerelated academic institutions like Unani Medical College. He also said that a Unani Medical College will be set up in Turkey in collaboration with Jamia Markaz."
  },
  {
    "title": "50,000 job opportunities at Markaz Knowledge City",
    "desc": "Markaz Knowledge City celebrated Independence Day with great joy. National Flag was hoisted by Dr. MAH Azhari Al Kandi and Dr. Abdul Salam Muhammad. In the independence day message, Dr. Azhary said that our country and its freedom are the results of sweat, patience, persistence, and sacrifice of those with the courage to dream of freedom and make it a reality for their future generations. Dr. Abdul Salam Muhammad declared that there will be 50,000 job opportunities at Markaz Knowledge City as a gift for this Independence day."
  },
  {
    "title": "A text on the quintessential characters and tempting beauty of Prophet",
    "desc": "he first stage of love towards a person begins with a good understanding of him. Reading and listening are the first steps in trying to know. Then, when the will is too much, the letters begin to spread in the heart. One will go and see them and try to capture their choice. This is what all the lovers of the Prophet did for the last fourteen centuries.The branch of prophetic studies that discusses his name, beauty, character, utensils, diet, and way of life is known as ‘Shamailurasul’. His words, deeds, features, descriptions, lifestyle, attitudes, discourses, prophecies, family, lineage, and surroundings had been authentically codified by foregone scholars. There is no single man in this world who was recorded so much without a single sketch or a photo. All the major works of the time were transformed gradually as specific disciplines among religious sciences. ‘Shamailurasul’ is one of the most extensive and celebrated compilations on the description and attributes of the Prophet Muhammed PBUH, the messenger of Allah. Careful crafting and vivid depiction of the Prophet by which a portrait of his blessed physical appearance, habits, worship, daily routines, spirituality and much more is explained to the people.The human body is the first and most natural technological tool bestowed on any man. The prophetic lifestyle and practices give a new dimension to day-to-day life. Those actions transform the body on a metaphysical level. It motivates a man to take care of the soul in the best possible way and thereby cherish man’s relationship with the body. The best and easiest way to rejuvenate the soul is to imitate the lives of the Prophet. There is no other paradigm in history in which the human body can be enlightened to the ultimate truth, and the possibility of ensuring human liberation is inherent.Malabar Foundation for Research and Development at Markaz Knowledge City has published the book ‘The Joy of Imitation of Dr AP Abdul Hakeem Al Azhari, which is a rare of its kind in Malayalam literature about ‘Shamailurasul’. This book is a compilation of narrations of exemplary scholars like Imam Abu Isa Tirmidhi, Qadhi Iyadh, Imam Abu Hamid Al Ghazali, Imam Suyuti, Ibn Hajar al-Haytami, Imam Yusuf al-Shami, Imam Maqrizi, Sheikh Yusuf Nabhani, Sheikh Abdullah Lahji, Ustad Abdul Basir Saqafi Pilakkal, Ann Mary Schimmel, Ahmad Muhammadi and many more.The book is distinguished by its simple language, concise style and portable size. The book has got a wider acceptance among the readers. The first edition has been sold out completely and the publication is intending to have the second edition soon. The educational and moral aspects of ‘Shamailurasul’ works are enormous. On the one hand, they encourage people to virtues, nobility, compassion, justice, honesty, mutual understanding, and on the other hand, strongly condemn, fraudulence, arrogance, envy, slander, oppression, and other negative traits. Indeed, this book will give the reader a novel experience and will be a blueprint for a meaningful life."
  }
]
